package track.lessons.lesson6;

/**
 * Created by bakla410 on 30.03.17.
 */

interface BlockingQueue<T> {
    void put(T item); // положить элемент в очередь, если очередь полная, то блокируемся и ждем, пока в очереди появится свободное место
    T take(); // взять элемент из очереди, если очередь пустая, то ждем, пока в очереди появится элемент
    T poll(); // аналог take(), но не ждем (не блокируемся), а в случае полной очереди сразу возвращаем false
    boolean offer(T item); // аналог put(), но не ждем, в случае пустой очереди возвращаем false
}